{"title":"A Study of Operation in Video Game Intellectual Property across Nations, Based on Comparisons between The Witcher and Chinese Paladin","date":"2020-06-25T14:50:41.000Z","date_formatted":{"ll":"Jun 25, 2020","L":"06/25/2020","MM-DD":"06-25"},"thumbnail":"https://cdn.wardzhou.art/img/copyright-5132627_1280.webp","link":"2020/06/25/Academic-GameIntellectualProperty","comments":true,"tags":["IP","Study"],"categories":["Academic"],"updated":"2020-12-14T15:10:11.492Z","content":"<p>ABSTRACT</p>\n<blockquote>\n<p>Nowadays creative industry is drawing more attention. Intellectual Property as one of the key parts has significance to study. In this text, a new Axiology based model shall be introduced and two representative case will be analyzed. In the final part conclusion will be given and will discuss further on this study.</p>\n</blockquote>\n<p><strong>Key words: IP Operation; Video game; Axiology;</strong></p>\n<p><strong>1. Introduction</strong></p>\n<p>The global video game market size was valued at USD 151.06 billion in 2019 and is expected to grow at a Compound Annual Growth Rate (CAGR) of 12.9% from 2020 to 2027.[<a href=\"#_ftn1\">1]</a> Rapid growth of incoming of users and appearance of new revolutionary technology both in algorithm and hardware make it possible for video game to achieve a more expectable value. Furthermore, video game originates in other categories of content including literature. Therefore, development of video game itself could be regarded as a part of operation of intellectual property. Significance can be achieved through this study discussing how intellectual property is operated and converted to video game. In this text, reverent definitions will be given firstly. Two cases will be introduced in the following part, between witch this text will develop further comparing. A reasonable conclusion shall be drawn in the final part.</p>\n<p><strong>2. Definition</strong></p>\n<p>Definitions are of necessity which are also prerequisites of further study. Therefore, in this part several terms including Intellectual Property, video game and operation will be defined.</p>\n<p><strong>2.1</strong> <strong>Intellectual Property</strong></p>\n<p><strong>2.1.1 Abbreviation</strong></p>\n<p>Intellectual Property is commonly seen in abbreviation IP, which could lead to a misunderstanding. Intellectual Property is a sort of asset or estate differing from visible property. However, Intellectual Property right is a legalistic term clarifying the legal right of proprietor. When using IP the abbreviation, it could be misleading.</p>\n<p>2.1.2 Types of Intellectual Property</p>\n<p>Intellectual Property consists of five major types: trademark, trade secret, copyright, design right and patents. In the following part, detail explanations will be given.</p>\n<p>Trademark is used to identify specific product or service in certain market, which is a mark of distinctiveness. Trade secret is information that can benefits business. It is confidential and must be kept within certain organization. Copyright is a legal right with which the proprietor could recopy, publish, trade, or distribute work in musical, literary or artistic form at liberty. Design right enables the creator to protect design work like shape, color combination and pattern. Patent gives the owner a series of sole right in limited period. Patent shall be public for exclusive.</p>\n<p><strong>2.2 Video Game</strong></p>\n<p>A video game is an electronic game with which user could interact for feedback in all forms.[<a href=\"#_ftn2\">2]</a> The system not merely the software part but the hardware that supports to run a video game is a platform. For instance stream is a platform. However it could be nearly run at any PC(Personal Computer). On the contrary, Xbox and PlayStation has their own hardware and video games must strictly depends on them. Also, the software including the game is specially designed and optimized for the hardware, which is a complete industrial chain. The public generally prefer to call hardware like Xbox console.</p>\n<p><strong>2.3 Operation</strong></p>\n<p>Operation in verb form is operate, sharing common meaning of run, manage, plan, engage in. According to its regular match, operate is usually used with economical entity. Operate does not have specific subject and object, which utilizes it broadly and also make it complicated to define.</p>\n<p>In economy, operate is an activity that human involves in fields of production of commodity and circulation, which is a dynamic and scheme procedure. However, management concerns more about the normally functional of a certain business. Therefore the operation is the aim, and the management is the precondition and also the assurance of operation.</p>\n<p><strong>3.Comparasion</strong></p>\n<p>In the present text, two cases will be introduced and analyzed which are <em>The Witcher</em> and <em>Chinese Paladin.</em></p>\n<p>The two are both original developed basing on literal work. This session shall give brief introduction of the two cases. Further analysis will be proceed using value system theory.</p>\n<p><strong>3.1 Cases</strong></p>\n<p><strong>3.1.1 The Witcher</strong></p>\n<p>·    Novel</p>\n<p>The Witcher is based on a novel series by Andrzej Sapkowski who is a bestselling Polish author, from which the game structures the universe setting and characters personality. This novel revolves around a “Witcher” Geralt of Rivia telling a grand story. The Witcher was firstly published Polish science fiction and fantasy magazine Fantastyka in 1986 as a short story which was for a contest and the author won the third prize. And the final book of the series titled <em>Season of Storms</em> was published in 2013(Polish version) and 2018(English version)[<a href=\"#_ftn3\">3]</a>[<a href=\"#_ftn4\">4]</a></p>\n<p>·    Film and Television Series</p>\n<p><em>The Hexer</em> is the title of a 2001 film and a 2002 TV series, both directed by Marek Brodzki.[<a href=\"#_ftn5\">5]</a> In 2017 Plagie Image and Netflix announced <em>The Witcher</em> TV series in Twitter.[<a href=\"#_ftn6\">6]</a></p>\n<p>·    Video Game</p>\n<p><em>The Withcer</em> series, action role-playing game is of most fame which is developed and published by CD Projekt Red. The game series began in 2007 and met its closure in 2015. The Witcher 3: Wild Hunt along with complete DLC is now available on Xbox One, PlayStation 4, Windows and Nintendo Switch.[<a href=\"#_ftn7\">7]</a></p>\n<p>Since May 28, 2020 video game The Witcher series has sold 50 million copies.[<a href=\"#_ftn8\">8]</a></p>\n<p><strong>3.1.2 Chinese Paladin</strong></p>\n<p>·    Video Game</p>\n<p><em>Chinese Paladin</em> or <em>Legend of Sword and Fairy</em> is originally an action role-playing game which is firstly released in 1995 by Taiwanese company Softstar. The story tells about a server guy named Li Xiaoyao in Ordinary Hotel who came across Zhao Linger, a descendant of the Nuwa. Xianling Island where Zhao lives was assaulted. Therefore, Li took the responsibility of guarding Zhao in a journey aiming to seek her mother. <em>The Legend of Sword and Fairy 6</em> was published in 2015. Accounting to official social account of the publisher, <em>The Legend of Sword and Fairy 6</em> sold 720 thousand copies within a month.</p>\n<p>·    Television Series</p>\n<p><em>Chinese Paladin</em> is Chinese television series adapted from the original game in 2005 which is produced by Chinese Entertainment Shanghai. It achieved 2.77 point in Taiwan (1 is considered as a satisfying point).[<a href=\"#_ftn9\">9]</a></p>\n<p>·    Authored Novel</p>\n<p>Father of <em>Chinese Paladin</em> Yao Zhuangxian achieve partnership with Chinese Wuxia author Guan Pingchao, coworking on a novel. They kept the original universe setting and the characters, but starts a new standalone storyline. The first book of the series was published on October, 2012.[<a href=\"#_ftn10\">10]</a></p>\n<p><strong>3.2 Axiology</strong></p>\n<p>Axiology focus on value connections among objects in society, and its nature as well as developing outline. It has two levels: the first concerns more on functional nature of objects, and the second centers human being which put more concerns on the value that the object could benefit human being. Based this framework, this text will introduce a new model explaining changes of value in a process of a IP operation.</p>\n<p><strong>3.3 Introduction of new model</strong></p>\n<p>We are mostly study product when diving into the value of IP operation. As a product or commodity, it could have two dimensions. The first is commercial process and the second one is annexation level. This text shall put the two key factors of IP operation together, forming a new product matrix as Graph 1 displaying.</p>\n<p><img src=\"https://cdn.wardzhou.art/img/20201013225444.png\" alt=\"\" loading=\"lazy\" class=\"φbp\"></p>\n<blockquote>\n<p>Graph 3.1</p>\n</blockquote>\n<p>In Graph 3.1, X axis stands for annexation level; Y axis refers to commercial process. This flat consists all products in the market. In the following part, detailed explanation will be discussed.</p>\n<p><strong>3.3.1 The Four Quadrants</strong></p>\n<p>·    Quadrant I</p>\n<p>In this quadrant, a product has a higher commercial value but could be hard to revalued to exceed. Certain traditional industry like real estate could be part of this quadrant.</p>\n<p>·    Quadrant II</p>\n<p>In this quadrant, a product has a higher commercial value and the annexation level is high in the meantime. Products are mostly derived from other forms or combination of two or more products. Some brand product, adapted movie and game can be included in this quadrant.</p>\n<p>·    Quadrant III</p>\n<p>Most original creative work could be cataloged in this quadrant. The literature for instance is difficult to achieve commercial value, and apparently it is the very original form of product but with unlimited potential to expend its annexation level to achieve the commercial value.</p>\n<p>·    Quadrant IV</p>\n<p>In this quadrant, a product has a lower commercial value while the annexation level is higher than average. Part of the products in this quadrant could be in a field of creative common which is in charity. Documentary for instance, and the products of museum or any other artistic non-profit organizations could be included in this quadrant.</p>\n<p><strong>3.3.2 Derivative Tension</strong></p>\n<p>Firstly, explanation shall be given in this session shall about Derivative Tension. Please imagine you are planning a journey. Your cost is constant, you will not exceed the limit not only in money but your time cost. Then you open your map, all the spots stand for a place but may not meet your circumstance. After some math work, you draw a circle (may be an irregular shape) on the map, from which you are possibly in the center. Spots within the shape border are available for you to travel. The border actually helps you to get a collection of all possibility of your journey. Let’s come back to this topic. A product has its potential to derive, all possibility could be abstracted as a closed curve as it shows in Graph 3.2 which can be called Derivative Tension.</p>\n<p><img src=\"https://cdn.wardzhou.art/img/20201013225600.png\" alt=\"\" loading=\"lazy\" class=\"φbp\"></p>\n<blockquote>\n<p>Graph 3.2</p>\n</blockquote>\n<p><strong>3.3.3 Operation Routine</strong></p>\n<p>Referring to Graph 3.3, Product A is a certain product in original form. Just regard it as a literal work. What we are aiming is to exceed its commercial value. Therefore, we proceed a secondary development, making a movie which is Product B based on an adaption. It is apparent that Product B has higher commercial process and annexation level than Product A. Then we may redo this procedure. Now we get Product C and Product D (maybe more). It could be a origin sound track CD or other peripheral products. So far, we have explored the potential of Product A and accomplish achievements that a Quadrant III product is converted into dozens of Quadrant II products and that commercial value is realized in this routine.</p>\n<p><img src=\"https://cdn.wardzhou.art/img/20201013225704.png\" alt=\"\" loading=\"lazy\" class=\"φbp\"></p>\n<blockquote>\n<p>Graph 3.3</p>\n</blockquote>\n<p><strong>3.3.4 Audience: Another Variable</strong></p>\n<p>This text has talked about the new model based on Axiology and gives further explanations on the four quadrants, Derivative Tension and operation routine. In this part, another variable shall be discussed through the IP operation routine.</p>\n<p><img src=\"https://cdn.wardzhou.art/img/20201013225741.png\" alt=\"\" loading=\"lazy\" class=\"φbp\"></p>\n<blockquote>\n<p>Graph 3.4</p>\n</blockquote>\n<p>Graph 3.4 shows the changes of profit and audience in amount through the operation routine of Product A. In the first phrase the audience as well as the profit is at a low level at first, but the audience grows rapid when Product B is released while the profit is still in a slow growth. Product B as a second developed product originally from Product A, expanding the communication channels and increasing the exposure. However, Product B does not achieve much commercial values and requires high investment. When comes to the second and third phrase. The profit curve sharply grows while the audience curve is growing slow. Having the accumulation of audience and the public praise, Product C and Product D that are of high commercial value could finally achieved its valued. And this routine is almost dried up. Another routine will find its way to start a new journey.</p>\n<p><strong>3.4 Case Comparison</strong></p>\n<p><strong>3.4.1 Commercial Process and Annexation Level: High Similarity</strong></p>\n<p><em>The Witcher</em> and <em>Chinese Paladin</em> are both vintage IP. <em>The Witcher</em> could trace back to 1986 while <em>Chinese Paladin</em> was originally from 1995. The categories of derivatives are almost the same, including Novel, video game, Television series and other peripheral products.</p>\n<p><img src=\"https://cdn.wardzhou.art/img/20201013225824.png\" alt=\"\" loading=\"lazy\" class=\"φbp\"></p>\n<blockquote>\n<p>Graph 3.5</p>\n</blockquote>\n<p>As for the theme, the two are also quite similar. They both are fantasy fiction and effected by its domestic culture. As cases of IP operation, the two are of great success across history. However, The Witcher make more profits than Chinese Paladin, this text shall develop more in following part.</p>\n<p><strong>3.4.1 Routine and Audience: General Fitted Curve</strong></p>\n<p>As for the first phrase, <em>The Witcher</em> and <em>Chinese Paladin</em> differ in origin. <em>The Witcher</em> is a novel series which makes it has lower profit and audience than <em>Chinese Paladin</em> for video game has a lower entry barrier so that a larger amount of audience is more reasonable as it shows in Graph 3.6</p>\n<p>For the second phrase <em>The Witcher</em> caught up and beat <em>Chinese Paladin</em> in the third phrase. However <em>Chinese Paladin</em> shows a trend to overtake <em>The Witcher</em> in profit.</p>\n<p><img src=\"https://cdn.wardzhou.art/img/20201013225853.png\" alt=\"\" loading=\"lazy\" class=\"φbp\"></p>\n<blockquote>\n<p>Graph 3.6</p>\n</blockquote>\n<p><strong>3.4.2 Further Assumptions</strong></p>\n<p>·    Domestic Factor</p>\n<p>In the above text, some particular differences show up in comparison. The two IP both have video game but apparently <em>The Witcher</em> is more welcomed nationwide. A possible assumption is that <em>Chinese Paladin</em> is greatly affected by domestic culture, which creates a gap between culture. On the contrary <em>The Witcher</em> is less domestic and the publisher make efforts localizing the content which enables audience cross culture could feel engaged in.</p>\n<p>·    Platform Factor</p>\n<p>In the third phrase of Graph 6, <em>Chinese Paladin</em> shows a steady and rapid growth in profit while <em>The Witcher</em> is almost drained up. One of the most convincing factors could be platform. <em>The Witcher</em> video game is mainly released in console and computer, while <em>Chinese Paladin</em> focuses more on mobile phone which is a huge market. Additionally, console games are mostly buy-out in payment.</p>\n<p>Mobile games make it easier to make profit by VAS (value-added service) realizing consistent incoming.</p>\n<p><strong>4. Conclusion and Illumination</strong></p>\n<p><strong>4.1 Conclusion</strong></p>\n<p><em>The Witcher</em> and <em>Chinese Paladin</em> are of great success as an IP crossing time and nation. In the present text, discussion is mainly focused on value and operation of Intellectual Property. A new IP needs to excavate to achieve its potential value. However, selection of IP is of importance for each one differs in theme and possesses different Derivative Tension. In process of operation, diversity and localization is required. Not only the platforms but the forms should meet the needs of audience. Additionally, opportunity could make a difference. Be sure to follow the changes of era, and make proper adjustment of the operation strategy.</p>\n<p>Crisis could be a comeback.</p>\n<p><strong>4.2 Illumination</strong></p>\n<p>In former study of <em>Chinese Paladin</em>, consumption of emotion is mentioned for times. It may imply a different orientation in IP consumption among Chinese audience.</p>\n<p><strong>4.3 Limitation</strong></p>\n<p>This study is mainly based on self-introduced model which depends on Axiology. Further data and case are needed to prove and modify this model. Some of the unpublished data is missing which makes the present text less convincing. When reviewing former study, <em>The Witcher</em> relevant paper is in shortage or out of access for the limitation of the database. A further study should be proceeded, collecting fatal data and multiplicate case.</p>\n<p><strong>Special thanks to Professor Ren.</strong></p>\n<hr>\n<p>[<a href=\"#_ftnref1\">1]</a> Video Game Market Size, Share &amp; Trends Analysis Report By Device (Console, Mobile, Computer), By Type (Online, Offline), By Region, And Segment Forecasts, 2020 - 2027</p>\n<p>[<a href=\"#_ftnref2\">2]</a> Wikipedia. Video game. <a href=\"https://en.wikipedia.org/wiki/Video_game\" target=\"_blank\">https://en.wikipedia.org/wiki/Video_game</a></p>\n<p>[<a href=\"#_ftnref3\">3]</a> The Witcher official website. <a href=\"https://thewitcher.com/en/witcher1/\" target=\"_blank\">https://thewitcher.com/en/witcher1/</a></p>\n<p>[<a href=\"#_ftnref4\">4]</a> Wikipedia. The Witcher. <a href=\"https://en.wikipedia.org/wiki/The_Witcher\" target=\"_blank\">https://en.wikipedia.org/wiki/The_Witcher</a></p>\n<p>[<a href=\"#_ftnref5\">5]</a> Анджей Сапковский: «Мне пришлось искать свое русло. И я его нашел…». <a href=\"https://fantlab.ru/article446\" target=\"_blank\">https://fantlab.ru/article446</a></p>\n<p>[<a href=\"#_ftnref6\">6]</a> Twitter @plagieimage. <a href=\"https://twitter.com/PlatigeImage/status/864787632991219712\" target=\"_blank\">https://twitter.com/PlatigeImage/status/864787632991219712</a></p>\n<p>[<a href=\"#_ftnref7\">7]</a> Wikipedia. The Witcher (video game series).</p>\n<p><a href=\"https://en.wikipedia.org/wiki/The_Witcher\" target=\"_blank\">https://en.wikipedia.org/wiki/ The_Witcher_(video_game_series)</a></p>\n<p>[<a href=\"#_ftnref8\">8]</a> The Witcher Series Has Sold 50 Million Copies.</p>\n<p><a href=\"https://www.gamespot.com/articles/the-witcher-series-has-sold-50-million-copies/1100-6477851/\" target=\"_blank\">https://www.gamespot.com/articles/the-witcher-series-has-sold-50-million-copies/1100-6477851/</a></p>\n<p>[<a href=\"#_ftnref9\">9]</a> 新浪.《仙剑奇侠传》改编之同名电视剧带来收视狂潮. <a href=\"http://ent.sina.com.cn/v/m/2005-07-07/1114773007.html\" target=\"_blank\">http://ent.sina.com.cn/v/m/2005-07-07/1114773007.html</a></p>\n<p>[<a href=\"#_ftnref10\">10]</a> 百度百科. 仙剑奇侠传 （仙剑官方授权小说）.</p>\n<p><a href=\"https://baike.baidu.com/item/%E4%BB%99%E5%89%91%E5%A5%87%E4%BE%A0%E4%BC%A0/2678887#3\" target=\"_blank\">https://baike.baidu.com/item/仙剑奇侠传/2678887#3</a></p>\n","prev":{"title":"Life in Coronavirus #1","link":"2020/06/29/LifeInCorn-1"},"next":{"title":"落","link":"2020/06/20/Fall"},"plink":"http://wardzhou.art/2020/06/25/Academic-GameIntellectualProperty/","reward":true,"copyright":{"author":"Birch","license":"Attribution-NonCommercial-NoDerivatives 4.0 International(<a href=\"https://creativecommons.org/licenses/by-nc-nd/4.0/\" rel=\\\"external nofollow\\\" target=\\\"_blank\\\">CC BY-NC-ND 4.0</a>)","updated":"December 14, 2020"},"reading_time":"2743 words in 18 min"}